#---------------------------------------------------Part 1-----------------------------------------------------#
text =  "Розум у музі на оберіг, навіть на зламі часу, чуття звучать мелодії, що в душу віддають свій шарм. Ні слова не вийде з руки, все сильніша відчуваю."

num_sentences = text.count(".") + text.count("!") + text.count("?")
words = text.replace(".", "").replace("!", "").replace("?", "").split()
num_words = len(words)
print("Кількість слів у тексті:", num_words)
print("Кількість речень у тексті:", num_sentences)

#---------------------------------------------------Part 2-----------------------------------------------------#
def count_palindromes(text):
    count = 0
    words = text.split()
    for word in words:
        if word == word[::-1]:
            count += 1
    return count
text ="Розум у музі на оберіг, навіть на зламі часу, чуття звучать мелодії, що в душу віддають свій шарм. Ні слова не вийде з руки, все сильніша відчуваю."
print("Кількість паліндромів у тексті:", count_palindromes(text))


#---------------------------------------------------Part 3-----------------------------------------------------#
def is_palingram(word):
    return len(word) > 1 and word == word[::-1]

def count_palingrams(text):
    words = text.lower().split()
    palingrams = [(w1, w2) for i, w1 in enumerate(words) for w2 in words[i+1:] if is_palingram(w1+w2)]
    return len(palingrams)

text = "На столі лежав гарний келих. Якщо його перевернути, то він все одно буде гарним. Колесо завжди обертається навколо своєї осі, в якій спритно можуть розташуватися паліндроми і паліграми. Від кабаків до шоу-бізнесу, багато різних речей можуть бути цікавими для широкої публіки. Наприклад, великий гонорар від зйомок в кіно."
text = num_palingrams = count_palingrams(text)
print("Кількість паліграм у тексті:", num_palingrams)